app/views/dashboard/index.html.erb

SELECT "trades".* FROM "trades" WHERE "trades"."user_id" = 1 ORDER BY "trades"."entry_at" DESC, "trades"."entry_at" ASC
---
              <%
                curr_month_trades = current_user.trades.where(entry_at: Date.current.beginning_of_month.beginning_of_day..Date.current.end_of_month.end_of_day)

SELECT "trades".* FROM "trades" WHERE "trades"."user_id" = 1 ORDER BY "trades"."entry_at" DESC LIMIT 5
---
          month_weeks.each_with_index do |week_days, w_idx|
            week_trades = current_user.trades.where(entry_at: week_days.first.beginning_of_day..week_days.last.end_of_day)

SELECT COUNT(*) FROM "trades" WHERE "trades"."user_id" = 1
---
          <td class="py-3 text-right text-sm">
            <% total_yr_pnl = current_user.trades.select { |t| t.entry_at && t.entry_at.year == Date.current.year }.sum(&:pnl) %>