app/views/prop_firm_accounts/show.html.erb

        <span class="material-symbols-outlined text-[16px] text-brand">swap_horiz</span>
        Trades Asociados (<%= @account.trades.count %>)
---
SELECT "trades".* FROM "trades" WHERE "trades"."prop_firm_account_id" = 1
SELECT COUNT(*) FROM "trades" WHERE "trades"."prop_firm_account_id" = 1

            <% cumulative = @account.initial_balance %>
            <% @account.trades.order(:entry_at).each do |trade| %>
---
SELECT COUNT(DISTINCT DATE(entry_at) as day) FROM "trades" WHERE "trades"."prop_firm_account_id" = 1 AND "trades"."entry_at" IS NOT NULL
SELECT DATE(entry_at) FROM "trades" WHERE "trades"."prop_firm_account_id" = 1 AND "trades"."entry_at" IS NOT NULL