app/controllers/admin/users_controller.rb

  def index
    @users = User.recent

    # System Status & Health Metrics
    @openai_configured    = ENV['OPENAI_API_KEY'].present?
    @db_status            = (ActiveRecord::Base.connection.active? rescue false)
    @total_users          = User.count
    @onboarded_users      = User.where(onboarding_completed: true).count
    @pro_users            = User.select(&:pro?).count
    @total_trades         = Trade.count
    @total_global_pnl     = Trade.sum(:pnl)
    @total_ai_analyses    = AiAnalysis.count
    @avg_discipline_score = (AiAnalysis.average(:discipline_score)&.round(1) || 0.0)
    @total_posts          = Post.count
    @total_trade_shares   = TradeShare.count
---
SELECT COUNT(*) FROM "users"
SELECT COUNT(*) FROM "users" WHERE "users"."onboarding_completed" = TRUE
SELECT COUNT(*) FROM "trades"
SELECT SUM("trades"."pnl") FROM "trades"
SELECT COUNT(*) FROM "posts"
SELECT COUNT(*) FROM "trade_shares"