app/views/community/leaderboards/index.html.erb

SELECT "trades".* FROM "trades" WHERE "trades"."user_id" IN (6, 8, 1, 2, 3, 4, 5, 7)
SELECT COUNT(*) FROM "trades" WHERE "trades"."user_id" = 6
---
              <p class="text-sm font-bold dark:text-white text-slate-800 truncate"><%= user.name || user.email %></p>
              <p class="text-[11px] text-slate-400"><%= user.trades.count %> operaciones</p>

SELECT COUNT(*) FROM "trades" WHERE "trades"."user_id" = 8
---
              <p class="text-sm font-bold dark:text-white text-slate-800 truncate"><%= user.name || user.email %></p>
              <p class="text-[11px] text-slate-400"><%= user.trades.count %> operaciones</p>

SELECT COUNT(*) FROM "trades" WHERE "trades"."user_id" = 6
---
            </td>
            <td class="py-4 px-5 text-right font-mono dark:text-slate-300 text-slate-600"><%= user.trades.count %></td>