app/views/community/classrooms/index.html.erb

          </span>
          <span class="text-[10px] text-slate-400"><%= classroom.enrollments.count %> inscritos</span>
---
SELECT COUNT(*) FROM "enrollments" WHERE "enrollments"."classroom_id" = 18