app/views/notifications/_notification.html.erb

INSERT INTO "notifications" ("user_id", "title", "message", "category", "read", "created_at", "updated_at") VALUES (4, '¡Bienvenido a CoachTrading PRO! 🚀', 'Tu diario de trading inteligente está activo. Registra tu primera operación o prueba el AI Coach.', 'system', FALSE, '2026-09-17 17:39:10.454023', '2026-09-17 17:39:10.454023') RETURNING "id"
---
      <p class="text-[11px] dark:text-slate-300 text-slate-600 mt-1 leading-snug"><%= notification.message %></p>
      <p class="text-[9px] text-slate-400 mt-1.5 uppercase tracking-widest font-bold"><%= time_ago_in_words(notification.created_at) %> atrás</p>