app/views/community/trade_shares/index.html.erb

            <div class="w-10 h-10 rounded-2xl bg-gradient-to-tr from-brand to-violet-600 flex items-center justify-center text-white font-black text-sm shadow-md">
              <%= share.user.name&.first&.upcase || "?" %>
---
SELECT "users".* FROM "users" WHERE "users"."id" IN (2, 1)

              <span class="material-symbols-outlined text-[15px] text-brand">notes</span>
              <span><%= share.trade&.trade_notes&.count || 0 %> notas</span>
---
SELECT "trades".* FROM "trades" WHERE "trades"."id" IN (242, 222)
SELECT COUNT(*) FROM "trade_notes" WHERE "trade_notes"."trade_id" = 242

              <span class="material-symbols-outlined text-[15px] text-emerald-500">smart_toy</span>
              <span><%= share.trade&.ai_analyses&.count || 0 %> análisis IA</span>
---
SELECT COUNT(*) FROM "ai_analyses" WHERE "ai_analyses"."trade_id" = 242