app/views/community/trade_shares/index.html.erb

SELECT COUNT(*) FROM "trade_notes" WHERE "trade_notes"."trade_id" = 242
SELECT COUNT(*) FROM "ai_analyses" WHERE "ai_analyses"."trade_id" = 242
---
        <div class="flex items-center gap-4">
          <span class="text-[10px] text-slate-400">🗨️ <%= share.trade&.trade_notes&.count || 0 %> notas</span>
          <span class="text-[10px] text-slate-400">👍 <%= share.trade&.ai_analyses&.count || 0 %> análisis</span>