app/views/users/profile/show.html.erb

SELECT "strategies".* FROM "strategies" WHERE "strategies"."user_id" = 2
---
        <div class="space-y-3 text-xs">
          <% current_user.strategies.each do |st| %>

SELECT "strategies".* FROM "strategies" WHERE "strategies"."user_id" = 4
---

          <% if current_user.strategies.empty? %>