app/views/users/profile/show.html.erb

SELECT "trades".* FROM "trades" WHERE "trades"."user_id" = 1
---

          <% if current_user.trader_type.present? %>

SELECT "strategies".* FROM "strategies" WHERE "strategies"."user_id" = 7
---
        <div class="space-y-3 text-xs">
          <% current_user.strategies.each do |st| %>

SELECT COUNT(*) FROM "strategies" WHERE "strategies"."user_id" = 2
---

          <% if current_user.strategies.empty? %>