app/views/community/chat_rooms/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 4 ORDER BY "users"."id" ASC LIMIT 1
---
              <div class="w-6 h-6 rounded-full bg-indigo-100 dark:bg-darkCard flex items-center justify-center text-[10px] font-bold text-indigo-600 flex-shrink-0">
                <%= message.user.name&.first&.upcase %>