app/views/community/_post_card.html.erb

SELECT COUNT(*) FROM "reactions" WHERE "reactions"."post_id" = 1 AND "reactions"."reaction_type" = 'like'
SELECT COUNT(*) FROM "reactions" WHERE "reactions"."post_id" = 1 AND "reactions"."reaction_type" = 'heart'
---
    <span class="flex items-center gap-1">👍 <%= post.reactions.where(reaction_type: 'like').count %></span>
    <span class="flex items-center gap-1">❤️ <%= post.reactions.where(reaction_type: 'heart').count %></span>
    <span class="flex items-center gap-1">🔥 <%= post.reactions.where(reaction_type: 'fire').count %></span>

SELECT 1 AS one FROM "comments" WHERE "comments"."post_id" = 1 LIMIT 1
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 1 LIMIT 3
---
  </div>
  <% if post.comments.any? %>
    <div class="border-t border-slate-200 dark:border-darkBorder pt-3 mb-3 space-y-2">
      <% post.comments.includes(:user).limit(3).each do |comment| %>

SELECT "users".* FROM "users" WHERE "users"."id" = 1
---
          <div class="w-6 h-6 rounded-full bg-indigo-100 dark:bg-darkCard flex items-center justify-center text-[10px] font-bold text-indigo-600 dark:text-indigo-400 flex-shrink-0">
            <%= comment.user&.name&.first&.upcase || "?" %>