app/views/community/_post_card.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
---
    <div class="w-10 h-10 rounded-2xl bg-gradient-to-tr from-brand to-violet-600 flex items-center justify-center text-white font-extrabold text-sm shadow-md shadow-brand/20 flex-shrink-0">
      <%= post.user&.name&.first&.upcase || post.user&.email&.first&.upcase || "?" %>

SELECT COUNT(*) FROM "reactions" WHERE "reactions"."post_id" = 7 AND "reactions"."reaction_type" = 'like'
---
      <span class="material-symbols-outlined text-[16px] text-emerald-500">thumb_up</span>
      <span><%= post.reactions.where(reaction_type: 'like').count %></span>

SELECT COUNT(*) FROM "reactions" WHERE "reactions"."post_id" = 7 AND "reactions"."reaction_type" = 'heart'
---
      <span class="material-symbols-outlined text-[16px] text-rose-500">favorite</span>
      <span><%= post.reactions.where(reaction_type: 'heart').count %></span>

SELECT COUNT(*) FROM "reactions" WHERE "reactions"."post_id" = 7 AND "reactions"."reaction_type" = 'fire'
---
      <span class="material-symbols-outlined text-[16px] text-amber-500">local_fire_department</span>
      <span><%= post.reactions.where(reaction_type: 'fire').count %></span>

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 7
---
      <span class="material-symbols-outlined text-[15px]">chat_bubble</span>
      <span><%= post.comments.count %> comentarios</span>

SELECT 1 AS one FROM "comments" WHERE "comments"."post_id" = 7 LIMIT 1
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 7 LIMIT 3
SELECT "users".* FROM "users" WHERE "users"."id" IN (4, 7, 6)
---
  <!-- COMMENTS PREVIEW -->
  <% if post.comments.any? %>
    <div class="pt-1 mb-3 space-y-2.5">
      <% post.comments.includes(:user).limit(3).each do |comment| %>

SELECT "users".* FROM "users" WHERE "users"."id" = 1
---
          <div class="w-6 h-6 rounded-full bg-brand/20 text-brand font-bold text-[10px] flex items-center justify-center flex-shrink-0 mt-0.5">
            <%= comment.user&.name&.first&.upcase || "?" %>