app/controllers/community/chat_rooms_controller.rb

    def index
      @chat_rooms = ChatRoom.all
      @chat_room = ChatRoom.find_or_create_by(name: "General")
      @messages = @chat_room.messages.includes(:user).order(created_at: :asc).last(50)
---
SELECT "chat_rooms".* FROM "chat_rooms" WHERE "chat_rooms"."name" = 'General' LIMIT 1
SELECT "messages".* FROM "messages" WHERE "messages"."chat_room_id" = 16 ORDER BY "messages"."created_at" DESC LIMIT 50
SELECT "users".* FROM "users" WHERE "users"."id" IN (3, 2, 4)