app/controllers/community/classrooms_controller.rb

    def index
      @classrooms = Classroom.all.includes(:author).recent.limit(20)
---
SELECT "classrooms".* FROM "classrooms" ORDER BY "classrooms"."created_at" DESC LIMIT 20