app/controllers/community/feed_controller.rb

    def create
      @post = current_user.posts.build(post_params)
      if @post.save
---
INSERT INTO "posts" ("user_id", "content", "visibility", "status", "created_at", "updated_at") VALUES (4, 'mi estrategi 2026 aquii', 'public', 'active', '2026-09-19 16:38:26.134320', '2026-09-19 16:38:26.134320') RETURNING "id"