app/controllers/community/leaderboards_controller.rb

SELECT "trades".* FROM "trades" WHERE "trades"."user_id" IN (6, 8, 1, 2, 3, 4, 5, 7)
SELECT SUM("trades"."pnl") FROM "trades" WHERE "trades"."user_id" = 6
SELECT users.*, COUNT(trades.id) as trades_count, COALESCE(SUM(trades.pnl), 0) as total_pnl, COALESCE(AVG(CASE WHEN trades.result = 'WIN' THEN 1.0 ELSE 0.0 END), 0) as win_rate FROM "users" LEFT JOIN trades ON trades.user_id = users.id GROUP BY "users"."id" ORDER BY total_pnl DESC, trades_count DESC LIMIT 10
---
    def index
      @users = User.includes(:trades).select("users.*, COUNT(trades.id) as trades_count, COALESCE(SUM(trades.pnl), 0) as total_pnl, COALESCE(AVG(CASE WHEN trades.result = 'WIN' THEN 1.0 ELSE 0.0 END), 0) as win_rate")
        .joins("LEFT JOIN trades ON trades.user_id = users.id")
        .group("users.id")
        .order("total_pnl DESC, trades_count DESC")
        .limit(50)

      @top_traders = @users.limit(10)