app/controllers/community/resources_controller.rb

SELECT "resources".* FROM "resources" ORDER BY "resources"."created_at" DESC LIMIT 20
---
    def index
      @resources = Resource.all.includes(:author).recent.limit(20)