app/controllers/community/trade_shares_controller.rb

    def index
      @trade_shares = TradeShare.where(privacy: "public").includes(:trade, :user).recent.limit(20)
---
SELECT "trade_shares".* FROM "trade_shares" WHERE "trade_shares"."privacy" = 'public' ORDER BY "trade_shares"."created_at" DESC LIMIT 20
SELECT "trades".* FROM "trades" WHERE "trades"."id" IN (242, 222)
SELECT "users".* FROM "users" WHERE "users"."id" IN (2, 1)