app/services/ai/trading_coach.rb

SELECT "trades".* FROM "trades" WHERE "trades"."user_id" = 4 ORDER BY "trades"."created_at" DESC LIMIT 10
SELECT COUNT(*) FROM "trades" WHERE "trades"."user_id" = 4
---
    def call_openai_for_chat(question)
      recent_trades = @user.trades.order(created_at: :desc).limit(10).map do |t|
        "[#{t.created_at&.strftime('%Y-%m-%d')}] #{t.symbol} #{t.direction} | #{t.result} ($#{t.pnl.to_f.round(2)}) | Emoción: #{t.emotion || 'N/A'}"
      end.join("\n        ")

      system_prompt = <<~PROMPT
        IDENTIDAD: CoachTrading PRO AI Coach. Misión: Analizar rendimiento y disciplina, no predecir mercado ni dar señales operativas.
        REGLA CORE: NUNCA calcules ni inventes métricas financieras. Usa SOLAMENTE las métricas dadas.
        PERFIL TRADER: Tipo: #{@user.trader_type || 'General'} | Mercado Principal: #{@user.main_market || 'Varios'} | Meta: #{@user.trading_goal || 'Mejorar Disciplina'}.

        MÉTRICAS GLOBALES (Backend Truth):
        - Operaciones totales: #{@user.trades.count}