app/services/trading/alert_manager.rb

SELECT COUNT(*) FROM "trades" WHERE "trades"."user_id" = 4 AND (entry_at >= '2026-09-17 00:00:00')
---
    def check_overtrading
      # Si el usuario ha hecho 5 o más trades hoy, disparamos alerta de overtrading
      trades_today = @user.trades.where("entry_at >= ?", Time.current.beginning_of_day).count