app/services/trading/calculate_statistics.rb

    def initialize(user_or_trades)
      @trades = user_or_trades.respond_to?(:trades) ? user_or_trades.trades.to_a : Array(user_or_trades)
---
SELECT "trades".* FROM "trades" WHERE "trades"."user_id" = 2