app/services/trading/csv_importer.rb

        trade.result = trade.pnl >= 0 ? "WIN" : "LOSS"
      end

      if trade.save
---
INSERT INTO "trades" ("user_id", "strategy_id", "symbol", "market", "direction", "timeframe", "setup", "entry_at", "exit_at", "entry_price", "exit_price", "stop_loss", "take_profit", "position_size", "capital_used", "risk_amount", "commission", "pnl", "pnl_percent", "r_multiple", "result", "emotion", "entry_reason", "exit_reason", "notes", "screenshot_url", "tags", "created_at", "updated_at", "portfolio_mode", "prop_firm_account_id") VALUES (4, NULL, 'MNQ', NULL, 'LONG', NULL, NULL, '2026-04-09 00:00:00', NULL, 18520.0, 18485.0, NULL, NULL, NULL, NULL, NULL, 0.0, -175.0, NULL, NULL, 'LOSS', NULL, NULL, NULL, NULL, NULL, NULL, '2026-09-20 20:56:50.653400', '2026-09-20 20:56:50.653400', 0, NULL) RETURNING "id"