app/controllers/ai_coach_controller.rb

  def show
    @ai_provider       = ENV.fetch('AI_PROVIDER', 'openrouter')
    @ai_model          = ENV.fetch('AI_MODEL', 'deepseek/deepseek-chat')
    @stats             = Trading::CalculateStatistics.new(current_user.trades).call
    @recent_trade      = current_user.trades.recent.first
    @last_analysis     = @recent_trade&.ai_analyses&.last
    @conversation      = current_user.ai_conversations.last ||
                         current_user.ai_conversations.create!(title: "Sesión de Coaching")
    @messages          = @conversation.ai_messages.order(:created_at)
---
SELECT "trades".* FROM "trades" WHERE "trades"."user_id" = 1
SELECT "ai_analyses".* FROM "ai_analyses" WHERE "ai_analyses"."trade_id" = 528 ORDER BY "ai_analyses"."id" DESC LIMIT 1
INSERT INTO "ai_conversations" ("user_id", "title", "created_at", "updated_at") VALUES (4, 'Sesión de Coaching', '2026-09-18 21:35:38.976795', '2026-09-18 21:35:38.976795') RETURNING "id"
SELECT "ai_conversations".* FROM "ai_conversations" WHERE "ai_conversations"."user_id" = 4 ORDER BY "ai_conversations"."id" DESC LIMIT 1
SELECT "ai_messages".* FROM "ai_messages" WHERE "ai_messages"."ai_conversation_id" = 1 ORDER BY "ai_messages"."created_at" ASC

  def chat
    question     = params[:message].to_s.strip
    stats        = Trading::CalculateStatistics.new(current_user.trades).call
    coach        = Ai::TradingCoach.new(current_user, stats)
    reply        = coach.ask(question)

    conversation = current_user.ai_conversations.last ||
                   current_user.ai_conversations.create!(title: "Sesión de Coaching")

    conversation.ai_messages.create!(role: "user",      content: question)
    conversation.ai_messages.create!(role: "assistant", content: reply)
---
SELECT "trades".* FROM "trades" WHERE "trades"."user_id" = 4 ORDER BY "trades"."created_at" DESC LIMIT 10
SELECT "ai_conversations".* FROM "ai_conversations" WHERE "ai_conversations"."user_id" = 4 ORDER BY "ai_conversations"."id" DESC LIMIT 1
INSERT INTO "ai_messages" ("ai_conversation_id", "role", "content", "created_at", "updated_at") VALUES (4, 'assistant', 'Como trader de Futures (NQ / MNQ (Nasdaq 100)), tu estrategia más consistente según tus estadísticas es ''Breakout'' con un Win Rate superior a 68%.', '2026-09-18 20:28:49.915124', '2026-09-18 20:28:49.915124') RETURNING "id"
INSERT INTO "ai_messages" ("ai_conversation_id", "role", "content", "created_at", "updated_at") VALUES (4, 'assistant', 'Como trader de Futures (NQ / MNQ (Nasdaq 100)), he analizado tus operaciones para tu objetivo de ''Gestionar plataforma y comunidad''. Tu Win Rate general es de 65.0% con un Profit Factor de 6.79.', '2026-09-18 21:12:52.346510', '2026-09-18 21:12:52.346510') RETURNING "id"

  def reset
    @conversation = current_user.ai_conversations.last
    if @conversation
      @conversation.destroy
---
SELECT "ai_conversations".* FROM "ai_conversations" WHERE "ai_conversations"."user_id" = 4 ORDER BY "ai_conversations"."id" DESC LIMIT 1
DELETE FROM "ai_conversations" WHERE "ai_conversations"."id" = 4