app/controllers/backtest_sessions_controller.rb

INSERT INTO "backtest_sessions" ("user_id", "name", "session_type", "account_size", "asset", "strategy_id", "start_date", "end_date", "notes", "max_daily_loss_pct", "max_drawdown_pct", "profit_target_pct", "prop_company", "status", "created_at", "updated_at") VALUES (2, 'apex', 'backtest', 50000.0, '', NULL, '2023-01-01', '2026-09-19', NULL, 3.0, 6.0, 6.0, NULL, 'active', '2026-09-19 23:10:16.251631', '2026-09-19 23:10:16.251631') RETURNING "id"
---
  def create
    @session = current_user.backtest_sessions.build(session_params)
    if @session.save