app/controllers/backtester_controller.rb

SELECT 1 AS one FROM "trades" WHERE "trades"."user_id" = 4 AND "trades"."portfolio_mode" = 2 LIMIT 1
---
  def show
    # En el futuro, aquí inicializaremos variables para el gráfico OHLC histórico y replay.
    # Por ahora, extraemos los trades registrados como "backtest" en la base de datos
    # para que el usuario pueda ver sus resultados simulados si quiso guardarlos manually.

    @backtest_trades = current_user.trades.where(portfolio_mode: :backtest).recent

    if @backtest_trades.any?