app/controllers/calendar_controller.rb

  def show
    @current_month = begin
      params[:month] ? Date.parse("#{params[:month]}-01") : Date.current.beginning_of_month
    rescue ArgumentError
      Date.current.beginning_of_month
    end

    start_date = @current_month.beginning_of_month.beginning_of_week(:monday)
    end_date   = @current_month.end_of_month.end_of_week(:sunday)

    # Solo generar datos de muestra si el usuario NO tiene ninguna operación creada en la base de datos
    ensure_sample_trades_for_month(@current_month) if current_user.trades.none?

    # Buscar operaciones del periodo visible en el calendario
    trades = current_user.trades.where(entry_at: start_date.beginning_of_day..end_date.end_of_day)
    @trades_by_date = trades.group_by { |t| t.entry_at.to_date }

    # Calcular estadísticas del mes seleccionado
    month_trades = current_user.trades.where(entry_at: @current_month.beginning_of_month.beginning_of_day..@current_month.end_of_month.end_of_day)

    total_pnl = month_trades.sum(:pnl)
    wins      = month_trades.select { |t| t.pnl.to_f > 0 }
    losses    = month_trades.select { |t| t.pnl.to_f < 0 }

    @month_stats = {
      total_pnl:    total_pnl,
      total_trades: month_trades.count,
      wins_count:   wins.count,
      losses_count: losses.count,
      win_rate:     month_trades.count > 0 ? (wins.count.to_f / month_trades.count * 100).round(1) : 0
---
SELECT 1 AS one FROM "trades" WHERE "trades"."user_id" = 2 LIMIT 1
SELECT "trades".* FROM "trades" WHERE "trades"."user_id" = 1 AND "trades"."entry_at" BETWEEN '2026-08-31 00:00:00' AND '2026-10-04 23:59:59.999999'
SELECT "trades".* FROM "trades" WHERE "trades"."user_id" = 2 AND "trades"."entry_at" BETWEEN '2026-08-31 00:00:00' AND '2026-10-03 23:59:59.999999'
SELECT "trades".* FROM "trades" WHERE "trades"."user_id" = 1 AND "trades"."entry_at" BETWEEN '2026-09-01 00:00:00' AND '2026-09-30 23:59:59.999999'
SELECT SUM("trades"."pnl") FROM "trades" WHERE "trades"."user_id" = 2 AND "trades"."entry_at" BETWEEN '2026-09-01 00:00:00' AND '2026-09-30 23:59:59.999999'
SELECT "trades".* FROM "trades" WHERE "trades"."user_id" = 2 AND "trades"."entry_at" BETWEEN '2026-09-01 00:00:00' AND '2026-09-30 23:59:59.999999'
SELECT COUNT(*) FROM "trades" WHERE "trades"."user_id" = 2 AND "trades"."entry_at" BETWEEN '2026-09-01 00:00:00' AND '2026-09-30 23:59:59.999999'

  def ensure_sample_trades_for_month(month_date)
    return unless current_user

    # Lista de activos y setups habituales
    symbols    = ["NQ_F", "ES_F", "EURUSD", "BTCUSD", "AAPL", "NVDA", "GBPUSD"]
    directions = ["LONG", "SHORT"]

    # Generar operaciones realistas en días laborables del mes
    (month_date.beginning_of_month..[month_date.end_of_month, Date.current].min).each do |date|
      next if date.saturday? || date.sunday?
      # 75% probabilidad de operar este día
      next if rand > 0.75

      trades_today_count = rand(1..3)
      trades_today_count.times do |i|
        symbol    = symbols.sample
        direction = directions.sample
        is_win    = rand > 0.35 # 65% win rate
        pnl       = is_win ? rand(120.0..650.0).round(2) : -rand(80.0..320.0).round(2)
        entry_p   = rand(150.0..18000.0).round(2)
        exit_p    = is_win ? (entry_p + rand(5.0..50.0)).round(2) : (entry_p - rand(5.0..30.0)).round(2)

        current_user.trades.create!(
          symbol:       symbol,
          direction:    direction,
          entry_price:  entry_p,
          exit_price:   exit_p,
          pnl:          pnl,
          entry_at:     date.to_time + (9 + i * 2).hours + rand(0..45).minutes,
          exit_at:      date.to_time + (10 + i * 2).hours + rand(0..45).minutes,
          result:       is_win ? "WIN" : "LOSS",
          r_multiple:   is_win ? rand(1.5..3.8).round(2) : -1.0,
          emotion:      ["Calmo", "Focado", "Ansioso", "Disciplinado"].sample
        )
---
INSERT INTO "trades" ("user_id", "strategy_id", "symbol", "market", "direction", "timeframe", "setup", "entry_at", "exit_at", "entry_price", "exit_price", "stop_loss", "take_profit", "position_size", "capital_used", "risk_amount", "commission", "pnl", "pnl_percent", "r_multiple", "result", "emotion", "entry_reason", "exit_reason", "notes", "screenshot_url", "tags", "created_at", "updated_at") VALUES (4, NULL, 'NVDA', NULL, 'SHORT', NULL, NULL, '2026-09-02 14:16:00', '2026-09-02 15:14:00', 2804.54, 2774.78, NULL, NULL, NULL, NULL, NULL, 0.0, -276.34, NULL, -1.0, 'LOSS', 'Calmo', NULL, NULL, NULL, NULL, NULL, '2026-09-17 17:09:08.520964', '2026-09-17 17:09:08.520964') RETURNING "id"