app/controllers/dashboard_controller.rb

  def index
    @current_mode = params[:mode].presence || 'real_account'

    unless Trade.portfolio_modes.keys.include?(@current_mode)
      @current_mode = 'real_account'
    end

    all_trades     = current_user.trades.where(portfolio_mode: @current_mode).recent
    @recent_trades = all_trades.limit(6)

    @stats         = Trading::CalculateStatistics.new(all_trades).call

    # Agregar Expectancy
    win_pct = @stats[:win_rate].to_f / 100.0
    loss_pct = @stats[:loss_rate].to_f / 100.0
    @stats[:expectancy] = (win_pct * @stats[:avg_win].to_f) - (loss_pct * @stats[:avg_loss].to_f.abs)

    @equity_data   = Trading::CalculateDrawdown.new(all_trades).equity_curve
    @pnl_by_day    = Trading::CalculateDailyPnl.new(all_trades).call

    # Mapa exacto de P&L por fecha para el calendario del dashboard
    @daily_pnl_map = all_trades.select { |t| t.entry_at.present? }
                               .group_by { |t| t.entry_at.to_date }
                               .transform_values { |ts| ts.sum(&:pnl).to_f }

    # Datos adicionales para el Nuevo Dashboard V2
    calculate_advanced_metrics(all_trades)

    @ai_diagnosis  = generate_ai_diagnosis(@stats)

    if current_user.notifications.empty?
      current_user.notifications.create!(
        title: "¡Bienvenido a CoachTrading PRO! 🚀",
        message: "Tu diario de trading inteligente está activo. Registra tu primera operación o prueba el AI Coach.",
        category: "system"
      )
---
SELECT "trades".* FROM "trades" WHERE "trades"."user_id" = 4 AND "trades"."portfolio_mode" = 0 ORDER BY "trades"."entry_at" DESC, "trades"."entry_at" ASC
SELECT 1 AS one FROM "trades" WHERE "trades"."user_id" = 4 AND "trades"."portfolio_mode" = 0 LIMIT 1
SELECT COUNT(*) FROM "trades" WHERE "trades"."user_id" = 1
SELECT 1 AS one FROM "notifications" WHERE "notifications"."user_id" = 2 LIMIT 1
INSERT INTO "notifications" ("user_id", "title", "message", "category", "read", "created_at", "updated_at") VALUES (2, '¡Bienvenido a CoachTrading PRO! 🚀', 'Tu diario de trading inteligente está activo. Registra tu primera operación o prueba el AI Coach.', 'system', FALSE, '2026-09-19 23:09:33.074104', '2026-09-19 23:09:33.074104') RETURNING "id"