app/controllers/dashboard_controller.rb

SELECT 1 AS one FROM "notifications" WHERE "notifications"."user_id" = 4 LIMIT 1
INSERT INTO "notifications" ("user_id", "title", "message", "category", "read", "created_at", "updated_at") VALUES (4, '¡Bienvenido a CoachTrading PRO! 🚀', 'Tu diario de trading inteligente está activo. Registra tu primera operación o prueba el AI Coach.', 'system', FALSE, '2026-09-17 17:39:10.454023', '2026-09-17 17:39:10.454023') RETURNING "id"
---
  def index
    all_trades     = current_user.trades.recent
    @recent_trades = all_trades.limit(5)
    @stats         = Trading::CalculateStatistics.new(all_trades).call
    @equity_data   = Trading::CalculateDrawdown.new(all_trades).equity_curve
    @pnl_by_day    = Trading::CalculateDailyPnl.new(all_trades).call

    @ai_diagnosis  = generate_ai_diagnosis(@stats)

    if current_user.notifications.empty?
      current_user.notifications.create!(
        title: "¡Bienvenido a CoachTrading PRO! 🚀",
        message: "Tu diario de trading inteligente está activo. Registra tu primera operación o prueba el AI Coach.",
        category: "system"
      )