app/controllers/notifications_controller.rb

UPDATE "notifications" SET "read" = TRUE WHERE "notifications"."user_id" = 4 AND "notifications"."read" = FALSE
---
  def mark_all_read
    current_user.notifications.unread.update_all(read: true)