app/controllers/onboarding_controller.rb

  def completar
    if params[:user].blank? || params[:user][:trading_goal].blank?
      redirect_to onboarding_paso_3_path, alert: "Por favor selecciona tu objetivo."
      return
    end

    session[:onboarding] ||= {}
    session[:onboarding][:trading_goal] = params[:user][:trading_goal]

    if current_user.update(
      trader_type:          session[:onboarding][:trader_type],
      main_market:          session[:onboarding][:main_market],
      trading_goal:         session[:onboarding][:trading_goal],
      onboarding_completed: true
    )
---
UPDATE "users" SET "updated_at" = '2026-09-18 19:44:57.742717', "onboarding_completed" = TRUE, "trading_goal" = 'Aprobar evaluación de fondeo (Prop Firm Evaluation)' WHERE "users"."id" = 7