app/controllers/pro_tools_controller.rb

  def index
    @active_tab = params[:tab].presence || "backtest"

    # --- BACKTEST TAB DATA ---
    @sessions     = current_user.backtest_sessions.where(session_type: "backtest").recent
    @new_session  = current_user.backtest_sessions.new(session_type: "backtest")
    @strategies   = current_user.strategies
    @prop_firms   = BacktestSession::PROP_FIRMS

    # --- PROP FIRM TAB DATA (CUENTAS & REGLAS) ---
    @accounts          = current_user.prop_firm_accounts.order(created_at: :desc)
---
SELECT "backtest_sessions".* FROM "backtest_sessions" WHERE "backtest_sessions"."user_id" = 2 ORDER BY "backtest_sessions"."created_at" DESC