app/controllers/prop_firm_accounts_controller.rb

SELECT "prop_firm_accounts".* FROM "prop_firm_accounts" WHERE "prop_firm_accounts"."user_id" = 2 ORDER BY "prop_firm_accounts"."created_at" DESC
---
  def index
    @accounts   = current_user.prop_firm_accounts.order(created_at: :desc)

SELECT "trades".* FROM "trades" WHERE "trades"."prop_firm_account_id" = 1
SELECT COUNT(*) FROM "trades" WHERE "trades"."prop_firm_account_id" = 1
---
  def show
    @trades      = @account.trades.recent.limit(20)

INSERT INTO "prop_firm_accounts" ("user_id", "prop_firm_rule_template_id", "name", "firm_name", "plan_name", "account_size", "phase", "status", "eval_fee", "activation_fee", "start_date", "custom_profit_target", "custom_max_drawdown", "custom_drawdown_type", "custom_daily_loss_limit", "custom_consistency_pct", "custom_min_trading_days", "created_at", "updated_at") VALUES (2, NULL, 'toptest 1', 'Topstep', 'Sin cuota de activación', '100K', 'paso_1', 'active', 49.0, 149.0, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-09-22 20:05:45.440718', '2026-09-22 20:05:45.440718') RETURNING "id"
---
  def create
    @account = current_user.prop_firm_accounts.new(account_params)
    @account.status ||= "activa"

    @account.strategy_ids = params[:strategy_ids] if params[:strategy_ids].present?

    if @account.save

SELECT "prop_firm_accounts".* FROM "prop_firm_accounts" WHERE "prop_firm_accounts"."user_id" = 2 AND "prop_firm_accounts"."id" = 1 LIMIT 1
---
  def set_account
    @account = current_user.prop_firm_accounts.find(params[:id])