app/controllers/prop_firm_accounts_controller.rb

  def index
    if current_user.prop_firm_accounts.none? && params[:skip_intro].blank?
---
SELECT 1 AS one FROM "prop_firm_accounts" WHERE "prop_firm_accounts"."user_id" = 2 LIMIT 1