app/controllers/strategies_controller.rb

  def set_strategy
    @strategy = current_user.strategies.find(params[:id])
---
SELECT "strategies".* FROM "strategies" WHERE "strategies"."user_id" = 1