app/controllers/subscriptions_controller.rb

UPDATE "users" SET "updated_at" = '2026-09-17 17:49:21.220570', "pro_status" = TRUE, "subscription_expires_at" = '2026-10-17 17:49:21.185927', "paypal_subscription_id" = 'SIM-PAYPAL-9FFF45FD0D9E' WHERE "users"."id" = 4
---
  def create
    # Simulador de Pago PayPal Exitoso
    current_user.update!(
      pro_status: true,
      subscription_expires_at: 1.month.from_now,
      paypal_subscription_id: "SIM-PAYPAL-#{SecureRandom.hex(6).upcase}"
    )