app/controllers/trades_controller.rb

  def create
    @trade = current_user.trades.build(trade_params)
    if @trade.save
---
INSERT INTO "trades" ("user_id", "strategy_id", "symbol", "market", "direction", "timeframe", "setup", "entry_at", "exit_at", "entry_price", "exit_price", "stop_loss", "take_profit", "position_size", "capital_used", "risk_amount", "commission", "pnl", "pnl_percent", "r_multiple", "result", "emotion", "entry_reason", "exit_reason", "notes", "screenshot_url", "tags", "created_at", "updated_at", "portfolio_mode", "prop_firm_account_id") VALUES (4, NULL, 'ETHUSD', NULL, 'LONG', NULL, 'Apex Trader Funding', '2026-09-20 21:01:54.278464', NULL, 3000.0, 3500.0, NULL, NULL, 1.0, NULL, NULL, 0.0, 500.0, NULL, NULL, 'WIN', 'calm', NULL, NULL, '', NULL, NULL, '2026-09-20 21:01:54.278640', '2026-09-20 21:01:54.278640', 0, NULL) RETURNING "id"

  def import_csv
    file = params[:csv_file]
    if file.present?
      csv_text = file.read.force_encoding("UTF-8")
      count    = 0
      CSV.foreach(csv_text.each_line, headers: true) do |row|
        current_user.trades.create(
          symbol:      row["symbol"] || row["Symbol"],
          direction:   row["direction"] || row["Side"] || "LONG",
          entry_price: row["entry_price"] || row["Entry"],
          exit_price:  row["exit_price"]  || row["Exit"],
          pnl:         row["pnl"] || row["PnL"],
          entry_at:    row["entry_at"] || row["Date"]
        )
---
INSERT INTO "trades" ("user_id", "strategy_id", "symbol", "market", "direction", "timeframe", "setup", "entry_at", "exit_at", "entry_price", "exit_price", "stop_loss", "take_profit", "position_size", "capital_used", "risk_amount", "commission", "pnl", "pnl_percent", "r_multiple", "result", "emotion", "entry_reason", "exit_reason", "notes", "screenshot_url", "tags", "created_at", "updated_at", "portfolio_mode", "prop_firm_account_id") VALUES (4, NULL, 'MNQ', NULL, 'LONG', NULL, NULL, '2026-04-09 00:00:00', NULL, 18520.0, 18485.0, NULL, NULL, NULL, NULL, NULL, 0.0, -175.0, NULL, NULL, 'LOSS', NULL, NULL, NULL, NULL, NULL, NULL, '2026-09-20 20:56:50.653400', '2026-09-20 20:56:50.653400', 0, NULL) RETURNING "id"

  def set_trade
    @trade = current_user.trades.find(params[:id])
---
SELECT "trades".* FROM "trades" WHERE "trades"."user_id" = 4 AND "trades"."id" = 266 LIMIT 1