app/controllers/trades_controller.rb

  def index
    @trades = current_user.trades.recent
    @trades = @trades.by_symbol(params[:symbol])                         if params[:symbol].present?
    @trades = @trades.where(direction: params[:direction])               if params[:direction].present?
    @trades = @trades.where(result: params[:result])                     if params[:result].present?
    @trades = @trades.where(strategy_id: params[:strategy_id])           if params[:strategy_id].present?
    @trades = @trades.where(trading_account_id: params[:account_id])     if params[:account_id].present?
---
SELECT COUNT(*) FROM "trades" WHERE "trades"."user_id" = 1