app/models/user.rb

INSERT INTO "notifications" ("user_id", "title", "message", "category", "read", "created_at", "updated_at") VALUES (5, '¡Bienvenido a CoachTrading PRO! 🚀', 'Tu plataforma de trading asistida por IA está lista. Configura tus estrategias, importa tu historial CSV o consulta a tu AI Coach para comenzar.', 'system', FALSE, '2026-09-18 19:11:22.317207', '2026-09-18 19:11:22.317207') RETURNING "id"
---
  def send_welcome_notification
    notifications.create!(
      title: "¡Bienvenido a CoachTrading PRO! 🚀",
      message: "Tu plataforma de trading asistida por IA está lista. Configura tus estrategias, importa tu historial CSV o consulta a tu AI Coach para comenzar.",
      category: "system"
    )