app/views/strategies/index.html.erb

    <% @strategies.each do |strategy| %>
      <% trades = current_user.trades.where(strategy_id: strategy.id) %>
---
SELECT "trades".* FROM "trades" WHERE "trades"."strategy_id" = 51