app/views/admin/users/index.html.erb

      <p class="text-[11px] text-slate-400 mt-2.5 leading-relaxed">
        Persistencia de datos operando sin latencia. <%= User.count %> usuarios y <%= Trade.count %> trades registrados.
      </p>
---
SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC
SELECT COUNT(*) FROM "trades"
SELECT COUNT(*) FROM "users"