app/views/backtester/show.html.erb

SELECT "strategies".* FROM "strategies" WHERE "strategies"."user_id" = 4
---
              <option value="">Auto-detectar de mis estrategias</option>
              <% current_user.strategies.each do |s| %>