app/controllers/users/profile_controller.rb

SELECT "trades".* FROM "trades" WHERE "trades"."user_id" = 1
SELECT COUNT(*) FROM "trades" WHERE "trades"."user_id" = 1
SELECT COUNT(*) FROM "trades" WHERE "trades"."user_id" = 1 AND "trades"."result" = 'WIN'
SELECT COUNT(*) FROM "trades" WHERE "trades"."user_id" = 1 AND "trades"."result" = 'LOSS'
---
  def show
    @user = current_user
    @stats = Trading::CalculateStatistics.new(current_user.trades).call
    @recent_trades = current_user.trades.recent.limit(5)
    @total_trades = current_user.trades.count
    @win_trades = current_user.trades.where(result: "WIN").count
    @loss_trades = current_user.trades.where(result: "LOSS").count

UPDATE "users" SET "timezone" = 'Bogota', "updated_at" = '2026-09-18 19:21:02.966838', "onboarding_completed" = TRUE, "trader_type" = 'beginner', "main_market" = 'futures' WHERE "users"."id" = 5
INSERT INTO "notifications" ("user_id", "title", "message", "category", "read", "created_at", "updated_at") VALUES (5, 'Perfil de Trading Adaptado 🎉', 'Configuración guardada para mercado ''FUTURES'' y nivel ''Beginner''. ¡Todo listo para operar con disciplina!', 'system', FALSE, '2026-09-18 19:21:03.044597', '2026-09-18 19:21:03.044597') RETURNING "id"
---
  def update
    was_completed = current_user.onboarding_completed
    if current_user.update(profile_params)
      if !was_completed && current_user.onboarding_completed
        current_user.notifications.create!(
          title: "Perfil de Trading Adaptado 🎉",
          message: "Configuración guardada para mercado '#{current_user.main_market.to_s.upcase}' y nivel '#{current_user.trader_type.to_s.titleize}'. ¡Todo listo para operar con disciplina!",
          category: "system"
        )