app/views/trades/_form.html.erb

                <label class="block text-xs font-bold text-slate-700 dark:text-slate-300 mb-1.5">Vincular a Cuenta de Fondeo Específica</label>
                <%= f.collection_select :prop_firm_account_id, current_user.prop_firm_accounts.order(created_at: :desc), :id, ->(acc) { "#{acc.name} (#{acc.firm_name} - #{acc.account_size})" }, { prompt: "Seleccionar cuenta activa..." }, class: "input-field w-full px-3 py-2 rounded-xl text-xs font-bold focus:outline-none focus:border-brand" %>
---
SELECT "prop_firm_accounts".* FROM "prop_firm_accounts" WHERE "prop_firm_accounts"."user_id" = 2 ORDER BY "prop_firm_accounts"."created_at" DESC