app/views/layouts/application.html.erb

SELECT COUNT(*) FROM "trades" WHERE "trades"."user_id" = 4
---
      <nav class="p-2.5 space-y-0.5 mt-1 flex-1">
        <% nav_items = [
          { label: "Dashboard",    path: dashboard_path,             icon: "dashboard" },
          { label: "Trades",       path: trades_path,                icon: "swap_horiz", count: current_user.trades.count },
          { label: "Estrategia",   path: strategies_path,            icon: "target" },
          { label: "Prop Firm",    path: pro_tools_path,             icon: "verified" },
          { label: "Backtesting",  path: backtester_path,            icon: "history" },
          { label: "AI Coach",     path: ai_coach_path,              icon: "smart_toy" },
          { label: "Comunidad",    path: community_feed_index_path,  icon: "forum" },
        ] %>

SELECT COUNT(*) FROM "notifications" WHERE "notifications"."user_id" = 4 AND "notifications"."read" = FALSE
---
            <span class="material-symbols-outlined text-[20px]">notifications</span>
            <%= render partial: "notifications/counter", locals: { count: current_user.notifications.unread.count } %>

SELECT "notifications".* FROM "notifications" WHERE "notifications"."user_id" = 4 ORDER BY "notifications"."created_at" DESC LIMIT 20
---
            <div id="notifications_list" class="max-h-80 overflow-y-auto dark:bg-[#141729] bg-white flex flex-col divide-y dark:divide-[#1E2235] divide-slate-100">
              <% current_user.notifications.recent.limit(20).each do |n| %>

SELECT 1 AS one FROM "notifications" WHERE "notifications"."user_id" = 4 LIMIT 1
---
              <% end %>
              <% if current_user.notifications.empty? %>